/****** Object:  View [dbo].[Номенклатура_S]    Committed by VersionSQL https://www.versionsql.com ******/

CREATE view [Номенклатура_S]
as
	SELECT Номенклатура.SYS_ID
	, isnull([Номенклатура].[Название]+' ','') +isnull('(Код:'+cast([Номенклатура].[Код] as varchar(20))+')','') AS Название
	, Номенклатура.SYS_U
	, Номенклатура.Тип, Номенклатура.Название AS Номенклатура
	, Справочники.Название AS ЕдИзм, Справочники.Параметр1 AS ОКЕИ
	, Номенклатура.СсылкаНом1С
	, Номенклатура1С.Код1С, Номенклатура1С.Название AS Номенклатура1С
	, Справочники_1.Название AS Группа, Номенклатура.Направление
	, Номенклатура.ID, Номенклатура.СерийныйНомер, Номенклатура.Характеристики
	, Номенклатура.НомерКаталог, Номенклатура.ИнвентарныйНомер
	, Номенклатура.Состояние
	, Номенклатура.Название +'   ('+isnull('НДС '+cast(Номенклатура.СтавкаНДС*100 as varchar(10))+'%','Без НДС')+')' AS НазваниеСНДС

	FROM ((Номенклатура 
	LEFT JOIN Справочники ON Номенклатура.ЕдИзм = Справочники.SYS_ID) 
	LEFT JOIN Номенклатура1С ON Номенклатура.СсылкаНом1С = Номенклатура1С.SYS_ID) 
	LEFT JOIN Справочники AS Справочники_1 ON Номенклатура.Группа = Справочники_1.SYS_ID