/****** Object:  Function [dbo].[__МтоНомосТовар]    Committed by VersionSQL https://www.versionsql.com ******/

CREATE FUNCTION [dbo].[МтоНомосТовар](@ОтКудаСклад varchar(32)=null, @ОтКудаУчасток varchar(32)=null, @КудаСклад varchar(32)=null, @КудаУчасток varchar(32)=null)
RETURNS TABLE 
AS
RETURN 
(
	SELECT Номенклатура.SYS_ID AS SYS_N, Номенклатура.ID AS НоменклатураID, СправочникиГруппа.Название AS ГруппаНоменклатуры
	, Номенклатура.Название +'   ('+isnull('НДС '+cast(Номенклатура.СтавкаНДС*100 as varchar(10))+'%','Без НДС')+')' AS Номенклатура
	, Номенклатура.Характеристики
	, Номенклатура.СерийныйНомер, Номенклатура.НомерКаталог, СправочникиЕдИзм.Название AS ЕдИзм
	, оус.Stoim AS СтоимостьОтКуда, оус.Kol AS ОстатокОтКуда, оуч.Kol AS ОстатокОтКудаУчасток
	, кус.Stoim AS СтоимостьКуда, кус.Kol AS ОстатокКуда, куч.Kol AS ОстатокКудаУчасток
	, Номенклатура1С.СтавкаНДС AS СтавкаНДС1С, Номенклатура.СсылкаНом1С
	, Номенклатура1С.Название  +'   ('+isnull('НДС '+cast(Номенклатура1С.СтавкаНДС*100 as varchar(10))+'%','Без НДС')+')' AS Номенклатура1С
	, Номенклатура1С.Код1С
	, Номенклатура.ГоденДо
	FROM		Номенклатура 
	LEFT JOIN	Справочники AS СправочникиЕдИзм ON Номенклатура.ЕдИзм = СправочникиЕдИзм.SYS_ID
	LEFT JOIN (	SELECT Товар, Sum(Колво) AS Kol, Sum(Стоим) AS Stoim	FROM Номос WHERE СКЛАД= @ОтКудаСклад																		GROUP BY Товар)  AS оус ON Номенклатура.SYS_ID = оус.Товар
	LEFT JOIN (	SELECT Товар, Sum(Колво) AS Kol							FROM Номос WHERE СКЛАД<>@ОтКудаСклад AND Участок=@ОтКудаУчасток	AND ТипУС<>'Поставщик' AND ТипУС<>'Ресурс'	GROUP BY Товар)  AS оуч ON Номенклатура.SYS_ID = оуч.Товар
	LEFT JOIN (	SELECT Товар, Sum(Колво) AS Kol, Sum(Стоим) AS Stoim	FROM Номос WHERE СКЛАД= @КудаСклад																			GROUP BY Товар)  AS кус ON Номенклатура.SYS_ID = кус.Товар
	LEFT JOIN (	SELECT Товар, Sum(Колво) AS Kol							FROM Номос WHERE СКЛАД<>@КудаСклад   AND Участок=@КудаУчасток	AND ТипУС<>'Поставщик' AND ТипУС<>'Ресурс'	GROUP BY Товар)  AS куч ON Номенклатура.SYS_ID = куч.Товар
	LEFT JOIN	Справочники AS СправочникиГруппа ON Номенклатура.Группа = СправочникиГруппа.SYS_ID
	LEFT JOIN	Номенклатура1С ON Номенклатура.СсылкаНом1С = Номенклатура1С.SYS_ID
	WHERE (Номенклатура.Тип='Товар' Or Номенклатура.Тип='Услуга') --AND (Номенклатура.SYS_U Is Null)
)